content/main/20211008132927-roles.md
+++
title = "Roles"
author = ["System Administrator"]
draft = false
+++

I organize my life around roles: 4 Major Roles and other minor roles.(this would change over time)
It's fun that the Major and Minor roles have similar feature to Major and Minor modes in emacs.


## Core Idendificaiton {#core-idendificaiton}


### Scholar {#scholar}

I'm a scholar.

By that I mean I'm a scholar who grow his intimacy with the notes, books, ideas and reallity.
I get to know things, I became familiar, became friends with them.
I create my own calming air.
I do things with my own pace, I do them actively and out of my own intention of having fun.
All the stuffs I play with, they are not tools leading to fortune or fame or power. They are loyal friends, they are funs to have.

It's a totally different mindset that I endure unpleasant to have fortune and I endure unpleasant to have fun with the area prerequisiting the unpleasant parts.


## Major Roles {#major-roles}


### [Artist]({{< relref "20211008134350-artist.md" >}}) {#artist--20211008134350-artist-dot-md}

Artist treat everything with **art**


### [Neuralscientist]({{< relref "20211012021721-neuralscientist.md" >}}) {#neuralscientist--20211012021721-neuralscientist-dot-md}

Neuralscientist could understand brain and **consciousness**


### [Engineer]({{< relref "20211102001428-engineer.md" >}}) {#engineer--20211102001428-engineer-dot-md}

Engineer **hack** things


### [Athlete]({{< relref "20211008134506-athlete.md" >}}) {#athlete--20211008134506-athlete-dot-md}

Athlete have sportsmanship and strong **willpower**


## Minor Roles {#minor-roles}


### Relationships {#relationships}


#### Son {#son}